
//线路数据
export default [
  {
    type: 1,
    name: '路线一',
    hdsj: '2020年8月10日  星期一',
    hdjs: '高明区青少年法治教育基地——佛山市 高明区人民检察院',
    periods: [
      {
        time: '08:00-08:25', 
        addr: '街心公园集合'
      },
      {
        time: '08:25-08:30', 
        addr: '前往青少年法治教育基地',
      },
      {
        time: '08:30-09:30', 
        addr: '参观青少年法治教育基地',
      },
      {
        time: '09:30-09:45', 
        addr: '前往人民检察院',
      },
      {
        time: '09:45-11:00', 
        addr: '参观人民检察院',
      },
      {
        time: '11:00-11:20', 
        addr: '返程',
      },
      {
        time: '11:20', 
        addr: '解散'
      },
    ]
  },
  {
    type: 2,
    name: '路线二',
    hdsj: '2020年8月12日  星期三',
    hdjs: '云勇林场、海螺水泥',
    periods: [
      {
        time: '08:00-08:15', 
        addr: '荷城广场集合'
      },
      {
        time: '08:15-09:15', 
        addr: '前往云勇林场',
      },
      {
        time: '09:30-11:30', 
        addr: '参观云勇林场及游戏体验',
      },
      {
        time: '11:30-13:30', 
        addr: '午餐、午休',
      },
      {
        time: '13:30-14:30', 
        addr: '前往海螺水泥',
      },
      {
        time: '14:30-15:30', 
        addr: '参观海螺水泥',
      },
      {
        time: '15:30-15:50', 
        addr: '前往众塑联'
      },
      {
        time: '15:50-17:00', 
        addr: '参观众塑联'
      },
      {
        time: '17:00', 
        addr: '返程、解散'
      },
    ]
  }
];
