<template>
  <div class="ydxz">
    <div class="header">
      2021年佛山市高明区公开招聘中小学教师公告<br />（第三场）
    </div>
    <div class="content">
      <div>
        为适应教育教学发展需要，根据《广东省事业单位公开招聘人员办法》（省政府令〔2009〕139号）、《关于修订&lt;佛山市高明区事业单位招聘工作人员实施细则&gt;的通知》（明府字〔2011〕11号）等文件精神，佛山市高明区面向全国公开招聘中小学教师（第三场）80名。现将有关事项公告如下：
      </div>
      <div class="content_title">一、招聘职位</div>
      <div class="content_content">
        本次共招聘高明区中学语文、数学、英语、政治、历史、地理、物理、化学、生物、音乐、体育、美术、心理健康，小学语文、数学、英语、音乐、体育、美术等19个学科共80名教师，属事业编制（公益一类）工作人员。招聘工作由区教育局负责组织实施，报考对象资格条件由佛山市高明区2021年教师招聘工作领导小组办公室负责审核。所有职位实行公开招考，经面谈或专业试、面试（授课，即正常上课）等环节并经体检、考察合格后，择优录用。录用后须在高明区教育系统工作满5年以上。
      </div>
      <div class="content_title">二、招聘对象</div>
      <div class="content_content">
        （一）应届毕业生。普通高等院校2021年应届毕业生（含择业期内普通高等院校毕业生）。港澳学习、国外留学归来人员报考者，报名时毕业不超过1年的视为应届毕业生。<br />（二）社会人员。指除应届毕业生外，已取得国家承认学历且符合条件的人员，含通过非普通高等学历教育形式（自学考试、函授、成人教育、网络教育、夜大、电大等）取得国家承认学历的人员。
      </div>
      <div class="content_title">三、招聘条件</div>
      <div class="content_content">
        （一）基本条件。<br />1.拥护中国共产党的领导，热爱社会主义，遵守中华人民共和国宪法、法律、法规；<br />2.具有中华人民共和国国籍，享有公民的政治权利；<br />3.具备良好的道德品行；
        　　<br />4.适应岗位要求的身体条件和符合职位要求的工作能力；<br />5.年龄为18周岁以上；<br />6.具有本科及以上学历；<br />7.具备相应学科的教师资格证，如报名时暂无法提供，须就本人教师资质提交承诺书，承诺于2021年8月31日前取得相应学科的教师资格证，否则取消聘用资格。其中中学要求具有高级中学教师资格证，小学要求具有小学或以上教师资格证；<br />（二）各类对象具体条件<br />1.应届毕业生，须符合以下条件：<br />（1）具有普通高等院校本科及以上学历、学士及以上学位；
        　　<br />（2）年龄为30周岁以下；<br />（3）以本科学历报考者，本科期间成绩符合综合排名在本专业前60%或者各学科平均分在75分及以上，或平均学分绩点达到2.5及以上。以研究生、国（境）外学历报考者不受此成绩条件限制。
        　　<br />2.社会人员，须同时符合以下条件：<br />（1）具有国家承认的本科及以上学历；<br />（2）年龄为35周岁以下；<br />（3）2020年9月1日至今连续在中小学校任教；社会人员应聘中小学教师岗位还至少具备以下任一条件：<br />①具备普通高等院校研究生学历、硕士及以上学位；<br />②高明区户籍（或生源）的人员，具备普通高等院校本科及以上学历、学士及以上学位；<br />③高明区公办中小学校的临聘教师，区沧江中学、区沧江中学附属小学临聘教师、校聘教师，具备普通高等院校本科及以上学历、学士及以上学位；<br />④曾获县区级及以上人民政府颁发的优秀教师、名教师、名班主任、骨干教师、学科带头人、首席教师、名师工作室主持人、教坛新秀等荣誉称号；<br />⑤省特级教师或具有学段及专业对口的副高级及以上专业技术资格的优秀教师，年龄可放宽至45周岁。<br />（三）具备岗位所需的其他资格条件，详见《2021年公开招聘中小学教师职位表（第三场）》。职位表的几点说明如下：<br />1.专业：根据《广东省2021年考试录用公务员专业目录》设置，考生应按专业目录中的名称和代码选择相对应的职位报考，如所学专业为目录中旧专业名称的，按照对应的新专业名称及代码报考。<br />考生不得报考所学专业代码与招考职位专业代码不一致的职位。所学专业未列入专业目录（没有专业代码）的，可选择专业目录中的相近专业报考，所学专业必修课程须与报考职位要求专业的主要课程基本一致，并在资格审核时提供毕业证书（已毕业的）、所学专业课程成绩单（须教务处盖章）、院校出具的课程对比情况说明及毕业院校设置专业的依据等材料。<br />学科教学、课程与教学论、小学教育等专业，如就业推荐表或成绩单上的专业名称无培养方向，考生须提供院校出具的培养方向证明。<br />2.学历、学位：国内普通高等院校应届毕业生须于2021年8月31日前取得相应毕业证书、学位证书，其他考生须于报名之日前取得相应毕业证书、学位证书。<br />港澳学习、国外留学归来人员报考，须提供教育部中国留学服务中心出具的境外学历、学位认证书。考生可登录教育部留学服务中心网站(http://www.cscse.edu.cn)按有关要求和程序查询认证。港澳学习、国外留学归来人员，须于2021年8月31日前取得教育部中国留学服务中心境外学历、学位认证书。<br />3.年龄：18周岁以上指2003年5月6日之前出生；30周岁以下指1990年5月6日之后出生；35周岁以下指1985年5月6日之后出生；45周岁以下指1975年5月6日之后出生。<br />4.工作经历时间：在校学习期间的社会实践经历及参加相关工作的（即在取得全日制学历毕业证前的工作经历），即使与单位签订劳动合同并开始缴纳社会保险，不视为工作经历。<br />年龄、工作经历的计算截止日期为本次考录报名的第一日（即2021年5月6日）。<br />5.高明生源：从高明区高中（或中职）学校毕业的人员。<br />在读的非应届普通高等院校毕业生、现役军人以及有关法律、法规和规章规定不宜录用的其他情形的人员，不得报名。<br />考生不得报考录用后即构成回避关系的招考职位。已经录用或聘用为本区公益一类事业单位工作人员的，不得报考。
      </div>
      <div class="content_title">四、招聘办法</div>
      <div class="content_content">
        本次招聘实行公开招考，经面谈或专业试、面试后择优录用。<br />（一）报名。<br />以网络报名形式进行，每位考生限报一个招聘岗位。<br />本次考试采取网络报名的报考方式。考生统一在“网上报名系统”（由此点击进入，稍后开通）报名。网上报名时间为2021年5月6日9：00至5月8日16：00（24小时开通报名）。<br />1.报名流程：
        　　<br />（1）网上提交报考申请。考生应仔细阅读招考公告，清楚具体职位资格条件，确认符合条件后在公告规定的报名时间登录“网上报名系统”，如实填写本人信息，并对所填信息的真实性、完整性及有效性负责。考生报名信息填写仅限在报名期间进行。报名开始前及结束后，考生不能进行填报或修改报考信息。<br />（2）网上初审。初审时间为5月9日至11日。考生可于2021年5月12日起在报考系统查询审核结果。<br />（3）网上打印准考证。报名初审通过后，考生应于面谈或专业试前登录“网上报名系统”下载打印《准考证》。该证于面谈、专业试和面试等全过程使用，请考生自行妥善保管。<br />（4）提交纸质应聘材料。在面谈或专业试现场，须向工作人员提交齐全的纸质应聘材料（详见附件2）。网上审核通过且现场纸质应聘材料审核通过后，方可进入面谈或专业试。在规定时间内未按要求当场提交纸质应聘材料的，视为自动放弃面谈或专业试资格。
        　　<br />2.报名注意事项：<br />（1）考生只能选择一个职位进行报名，报名必须使用有效期内的二代身份证，并且要如实填报个人信息，仔细核对电话号码、所学专业、考生类别等基本信息，确保真实有效。考生须对自己填报的资料负责，因填报资料失误导致审核不通过或影响录用结果的，由考生负责。
        　　<br />（2）考生须符合招聘公告要求并按报考职位的要求提交所有证件、证明原件及复印件（不得用电子版代替）。条件不符合要求、证件材料不齐或提供虚假材料的审核不予通过。考生须提供教师资格证或者就本人教师资质提交承诺书（教师资质承诺书须提前准备，详见附件4）。
        　　<br />（3）中小学校任教经历要求提供劳动合同（或单位开具的工作经历证明）和对应的社会保险缴纳记录，不能提供有效证明的视为不符合报名条件。
        　　<br />（4）考生须诚信报名、诚信考试，资格条件审核贯穿招聘工作全程。如考生资格条件不实或不符的，或在招聘过程中有违纪行为的，一经发现随时取消报考（聘用）资格。对伪造、变造有关证件、材料、信息，骗取考试资格的，将按有关规定予以处理。<br />（5）近五年在我区组织的教师招聘中放弃拟录用资格的，不再接受其报名考试。
        　　<br />（二）考试时间、地点。<br />1.面谈或专业试：<br />（1）时间：2021年5月中旬（具体以准考证上的时间安排为准）；
        　　<br />（2）地点：高明区西江新城第一小学（佛山市高明区荷城街道明湖南路338号）；
        　　<br />（3）方式：分学科进行面谈或专业试。<br />语文、数学、英语、政治、历史、地理、物理、化学、生物、心理健康等学科进行面谈；<br />音乐、体育、美术等学科进行专业试。专业考试内容为相关专业的专业技能（音乐科专业考试范围为钢琴、声乐和自选项目（即第二器乐、合唱指挥或舞蹈，美术科专业考试范围为素描、色彩，体育科专业考试范围包括但不限于篮球、足球）。考试时考生要自带乐器、绘画工具、绘画颜料、体育器材等。如音乐、体育职位报考人数超过该职位招录人数10倍时，则该职位可加考专业试初试，并按招录人数6倍比例确定进入专业试复试人员名单，初试成绩不计入考试总成绩。<br />面谈或专业试合格分数线为70分。<br />2.面试：
        　　<br />（1）对象：经资格审核和面谈、专业试，根据成绩从高至低排序，按所报职位招录人数的3倍比例在成绩合格的考生中确定面试对象并通知面试；
        　　<br />（2）时间：5月下旬（具体以通知为准）； 　　<br />（3）地点：高明区西江新城第一小学；
        　　<br />（4）形式：采用授课（正常上课）的形式，合格分数线为65分。
        　　<br />（三）成绩计算方式。<br />1.面谈学科：面谈成绩不计入最终总成绩，总成绩合格分数线为65分。
        　　<br />2.专业试学科：按专业考试占50%、面试占50%的比例合成总成绩。总成绩合格分数线为65分。<br />考试总成绩四舍五入保留小数点后2位。<br />3.注意事项：<br />所有考生须留意报名系统的信息发布，参加考试时，必须携带有效期内的二代身份证（临时身份证）原件和准考证，并严格按照规定时间参加考试，逾期未到场或未带齐证件原件的（不得以电子版代替）视为放弃考试资格。
      </div>
      <div class="content_title">五、体检和考核</div>
      <div class="content_content">
        考试结束后，按考试成绩由高到低的顺序，从考试成绩合格考生中等额确定体检对象。若同一职位考生总成绩相同的，参加专业试的，按面试成绩高低顺序确定名次，参加面谈的，按面试主考官评分高低顺序确定名次。<br />体检工作由区教育局统一组织，在指定的医院统一进行。具体体检事项安排另行通知。<br />事业单位工作人员的体检和考察按《广东省事业单位公开招聘人员体检实施细则（试行）》（粤人社发〔2010〕382号）、《广东省事业单位公开招聘人员考察工作实施细则（试行）》（粤人社发〔2010〕276号）和《关于印发〈广东省教师资格申请人员体格检查标准（2013年修订）〉的通知》（粤教继〔2013〕1号）执行。<br />体检合格的考生确定为拟录用考察人选，由区教育局按照录用考察工作的有关规定，对其政治思想、道德修养、能力素质、学习和工作表现、遵纪守法、廉洁自律、社会关系以及是否需要回避等方面的情况进行考察，并通过查阅个人档案等方式核实其是否符合报考资格条件。<br />如出现体检、考察不合格或放弃体检、录用的，可从考试合格的人员中依次递补人选。是否递补体检、考察人选，由区教育局研究决定。<br />如违约不按期报到的，5年内不得报考我区公办教师。
      </div>
      <div class="content_title">六、确定拟聘人员及公示</div>
      <div class="content_content">
        体检、考察合格者，经区教育局研究确定拟聘人选。拟聘人选在区人民政府网站公示7个工作日。
      </div>
      <div class="content_title">七、办理报批手续</div>
      <div class="content_content">
        拟聘用人员经公示无异议的，区教育局将按有关规定的程序和权限报区组织人事部门批准。
      </div>
      <div class="content_title">八、聘用和待遇</div>
      <div class="content_content">
        经体检和考察合格后，择优聘用并按所聘岗位享受事业单位工作人员的工资福利待遇。
      </div>
      <div class="content_title">九、考试防疫要求</div>
      <div class="content_content">
        结合当前疫情防控要求，考生须全程佩戴一次性医用外科口罩，且同时符合以下条件方可参加招聘考试。<br />（一）持本人“粤康码”绿码并提交《2021年佛山市高明区公开招聘中小学教师考生个人健康状况承诺书》（以下简称“健康状况承诺书”）。在进入考场时，考生应主动出示本人“粤康码”绿码并提交《健康状况承诺书》（为缩短进场时间，请提前打印填写承诺书完整信息）。无法出示本人“粤康码”，或“粤康码”为红码、黄码的，不能参加考试。<br />（二）体温检测正常。考生在进入考场时，应接受体温检测。体温≥37.3℃的，不能参加考试。<br />（三）重点人群需同时提供有效核酸检测证明。境外或国内中高风险地区抵（返）、考前14天内出现异常症状（发热、干咳、乏力、鼻塞、流涕、咽痛、腹泻等）的考生，需主动申报并在进入考场时一并提供考前7日内核酸检测阴性证明。不能提供或所提供证明不在有效期内的，不能参加考试。<br />（四）可按当地防疫部门最新要求对有关防疫事项进行调整。
      </div>
      <div class="content_title">十、其他</div>
      <div class="content_content">
        本次招聘不指定考试教材，不举办、也不委托任何机构举办考试辅导培训。社会上任何以教师招聘考试命题组、专门培训机构等名义举办的活动，均与本次招聘的组织方无关。<br />本次招聘的报名、考试、体检和考核工作由区教育局负责组织实施，本公告由佛山市高明区2021年教师招聘工作领导小组负责解释。<br />联系电话：0757-88282322（工作日上午9:00-12:00，下午15:00-17:30）。<br />附件1：2021年佛山市高明区公开招聘中小学教师职位表（第三场）.xls<br />附件2：考生提交纸质应聘材料清单.pdf<br />附件3：广东省2021年考试录用公务员专业参考目录.xls<br />附件4：教师资质承诺书.doc<br />附件5：2021年佛山市高明区公开招聘中小学教师考生个人健康状况承诺书.pdf
      </div>
      <div class="detail read">
        <van-checkbox
          v-model="checked"
          icon-size="4vw"
          :disabled="cannotClick"
        ></van-checkbox
        ><span @click="readFn">
          本人已认真阅读公告全文，明晰所有公告条件及要求。
        </span>
      </div>
      <div class="base">
        <div class="base-tab width">
          <div
            class="public-long-but"
            :class="{ noEdit: cannotClick }"
            @click="nextStep"
          >
            我已认真阅读并承诺<span v-if="cannotClick">（{{ count }}）</span>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      checked: false,
      count: 180,
      cannotClick: true,
    }
  },
  created () {
    setTimeout(this.countFn, 1000)
  },
  methods: {
    countFn () {  //倒数
      this.count--
      if (this.count === 0) {
        this.cannotClick = false
      } else {
        setTimeout(this.countFn, 1000)
      }
    },
    readFn () {
      this.checked = !this.checked
    },
    getWord (content) {
      return content || '无'
    },
    nextStep () {
      if (this.cannotClick) {
        return
      }
      if (!this.checked) {
        this.$toast.fail('请确认阅读招考公告')
      } else {
        this.$router.push('/jszp/wybm')
      }
    }
  }
}
</script>

<style lang="scss" scoped>
.ydxz {
  .header {
    margin-top: 40px;
    font-size: 32px;
    font-family: PingFang SC;
    font-weight: bold;
    text-align: center;
    color: rgba(51, 51, 51, 1);
    line-height: 56px;
  }
  .content {
    padding: 50px 50px 10px 50px;
    font-size: 28px;
    font-family: PingFang SC;
    font-weight: bold;
    color: rgba(51, 51, 51, 1);
    line-height: 48px;
    .content_title {
      font-size: 28px;
      font-weight: bold;
    }
    .content_content {
      font-weight: 400;
      font-size: 28px;
    }
    .detail {
      font-size: 28px;
      font-family: PingFang SC;
      font-weight: 400;
      color: rgba(51, 51, 51, 1);
      line-height: 48px;
    }
    .read {
      padding-top: 40px;
      .van-checkbox {
        display: inline-block;
        margin-right: 10px;
      }
    }
    .wordimg {
      width: 80px;
      height: 90px;
      img {
        width: 100%;
      }
    }
    .tip {
      height: 26px;
      font-size: 28px;
      padding: 50px 0;
      font-family: PingFang SC;
      font-weight: bold;
      color: rgba(16, 16, 16, 1);
      line-height: 37px;
    }
    .filename {
      padding-left: 28px;
      font-size: 28px;
      font-family: PingFang SC;
      font-weight: 400;
      color: rgba(51, 51, 51, 1);
      line-height: 35px;
    }
    .filesize {
      width: 50px;
      padding-left: 28px;
      font-size: 26px;
      font-family: PingFang SC;
      font-weight: 400;
      color: rgba(137, 137, 137, 1);
      line-height: 37px;
    }
    .public-long-but {
      background-color: #3296ea;
      margin-top: 30px;
      color: #fff;
    }
    .noEdit {
      background-color: rgba(137, 137, 137, 1);
    }
  }
}
</style>